zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_QUADSPI.h
#define QuadSPI_SPTRCLR_STREAM_EN_MASK           (0x40000U)
#define QuadSPI_SPTRCLR_STREAM_EN_SHIFT          (18U)
#define QuadSPI_SPTRCLR_STREAM_EN_WIDTH          (1U)
#define QuadSPI_SPTRCLR_STREAM_EN(x)             (((uint32_t)(((uint32_t)(x)) << QuadSPI_SPTRCLR_STREAM_EN_SHIFT)) & QuadSPI_SPTRCLR_STREAM_EN_MASK)
/*! @} */

/*! @name SFA1AD - Serial Flash Memory A1 Top Address Register */
/*! @{ */

#define QuadSPI_SFA1AD_TPADA1_MASK               (0xFFFFFC00U)
#define QuadSPI_SFA1AD_TPADA1_SHIFT              (10U)
#define QuadSPI_SFA1AD_TPADA1_WIDTH              (22U)
#define QuadSPI_SFA1AD_TPADA1(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_SFA1AD_TPADA1_SHIFT)) & QuadSPI_SFA1AD_TPADA1_MASK)
/*! @} */

/*! @name SFA2AD - Serial Flash Memory A2 Top Address Register */
/*! @{ */

#define QuadSPI_SFA2AD_TPADA2_MASK               (0xFFFFFC00U)
#define QuadSPI_SFA2AD_TPADA2_SHIFT              (10U)
#define QuadSPI_SFA2AD_TPADA2_WIDTH              (22U)
#define QuadSPI_SFA2AD_TPADA2(x)                 (((uint32_t)(((uint32_t)(x)) << QuadSPI_SFA2AD_TPADA2_SHIFT)) & QuadSPI_SFA2AD_TPADA2_MASK)
/*! @} */

/*! @name RBDR - RX Buffer Data Register */
/*! @{ */

#define QuadSPI_RBDR_RXDATA_MASK                 (0xFFFFFFFFU)
#define QuadSPI_RBDR_RXDATA_SHIFT                (0U)
#define QuadSPI_RBDR_RXDATA_WIDTH                (32U)
#define QuadSPI_RBDR_RXDATA(x)                   (((uint32_t)(((uint32_t)(x)) << QuadSPI_RBDR_RXDATA_SHIFT)) & QuadSPI_RBDR_RXDATA_MASK)
/*! @} */

/*! @name LUTKEY - LUT Key Register */
/*! @{ */

#define QuadSPI_LUTKEY_KEY_MASK                  (0xFFFFFFFFU)
#define QuadSPI_LUTKEY_KEY_SHIFT                 (0U)
#define QuadSPI_LUTKEY_KEY_WIDTH                 (32U)
#define QuadSPI_LUTKEY_KEY(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUTKEY_KEY_SHIFT)) & QuadSPI_LUTKEY_KEY_MASK)
/*! @} */

/*! @name LCKCR - LUT Lock Configuration Register */
/*! @{ */

#define QuadSPI_LCKCR_LOCK_MASK                  (0x1U)
#define QuadSPI_LCKCR_LOCK_SHIFT                 (0U)
#define QuadSPI_LCKCR_LOCK_WIDTH                 (1U)
#define QuadSPI_LCKCR_LOCK(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_LCKCR_LOCK_SHIFT)) & QuadSPI_LCKCR_LOCK_MASK)

#define QuadSPI_LCKCR_UNLOCK_MASK                (0x2U)
#define QuadSPI_LCKCR_UNLOCK_SHIFT               (1U)
#define QuadSPI_LCKCR_UNLOCK_WIDTH               (1U)
#define QuadSPI_LCKCR_UNLOCK(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_LCKCR_UNLOCK_SHIFT)) & QuadSPI_LCKCR_UNLOCK_MASK)
/*! @} */

/*! @name LUT - LUT Register */
/*! @{ */

#define QuadSPI_LUT_OPRND0_MASK                  (0xFFU)
#define QuadSPI_LUT_OPRND0_SHIFT                 (0U)
#define QuadSPI_LUT_OPRND0_WIDTH                 (8U)
#define QuadSPI_LUT_OPRND0(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_OPRND0_SHIFT)) & QuadSPI_LUT_OPRND0_MASK)

#define QuadSPI_LUT_PAD0_MASK                    (0x300U)
#define QuadSPI_LUT_PAD0_SHIFT                   (8U)
#define QuadSPI_LUT_PAD0_WIDTH                   (2U)
#define QuadSPI_LUT_PAD0(x)                      (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_PAD0_SHIFT)) & QuadSPI_LUT_PAD0_MASK)

#define QuadSPI_LUT_INSTR0_MASK                  (0xFC00U)
#define QuadSPI_LUT_INSTR0_SHIFT                 (10U)
#define QuadSPI_LUT_INSTR0_WIDTH                 (6U)
#define QuadSPI_LUT_INSTR0(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_INSTR0_SHIFT)) & QuadSPI_LUT_INSTR0_MASK)

#define QuadSPI_LUT_OPRND1_MASK                  (0xFF0000U)
#define QuadSPI_LUT_OPRND1_SHIFT                 (16U)
#define QuadSPI_LUT_OPRND1_WIDTH                 (8U)
#define QuadSPI_LUT_OPRND1(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_OPRND1_SHIFT)) & QuadSPI_LUT_OPRND1_MASK)

#define QuadSPI_LUT_PAD1_MASK                    (0x3000000U)
#define QuadSPI_LUT_PAD1_SHIFT                   (24U)
#define QuadSPI_LUT_PAD1_WIDTH                   (2U)
#define QuadSPI_LUT_PAD1(x)                      (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_PAD1_SHIFT)) & QuadSPI_LUT_PAD1_MASK)

#define QuadSPI_LUT_INSTR1_MASK                  (0xFC000000U)
#define QuadSPI_LUT_INSTR1_SHIFT                 (26U)
#define QuadSPI_LUT_INSTR1_WIDTH                 (6U)
#define QuadSPI_LUT_INSTR1(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_LUT_INSTR1_SHIFT)) & QuadSPI_LUT_INSTR1_MASK)
/*! @} */

/*! @name WORD0 - Flash Region Start Address */
/*! @{ */

#define QuadSPI_WORD0_STARTADR_MASK              (0xFFFF0000U)
#define QuadSPI_WORD0_STARTADR_SHIFT             (16U)
#define QuadSPI_WORD0_STARTADR_WIDTH             (16U)
#define QuadSPI_WORD0_STARTADR(x)                (((uint32_t)(((uint32_t)(x)) << QuadSPI_WORD0_STARTADR_SHIFT)) & QuadSPI_WORD0_STARTADR_MASK)
/*! @} */

/*! @name WORD1 - Flash Region End Address */
/*! @{ */

#define QuadSPI_WORD1_ENDADR_MASK                (0xFFFF0000U)
#define QuadSPI_WORD1_ENDADR_SHIFT               (16U)
#define QuadSPI_WORD1_ENDADR_WIDTH               (16U)
#define QuadSPI_WORD1_ENDADR(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_WORD1_ENDADR_SHIFT)) & QuadSPI_WORD1_ENDADR_MASK)
/*! @} */

/*! @name WORD2 - Flash Region Privileges */
/*! @{ */

#define QuadSPI_WORD2_MD0ACP_MASK                (0x7U)
#define QuadSPI_WORD2_MD0ACP_SHIFT               (0U)
#define QuadSPI_WORD2_MD0ACP_WIDTH               (3U)
#define QuadSPI_WORD2_MD0ACP(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_WORD2_MD0ACP_SHIFT)) & QuadSPI_WORD2_MD0ACP_MASK)

#define QuadSPI_WORD2_MD1ACP_MASK                (0x38U)
#define QuadSPI_WORD2_MD1ACP_SHIFT               (3U)
#define QuadSPI_WORD2_MD1ACP_WIDTH               (3U)
#define QuadSPI_WORD2_MD1ACP(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_WORD2_MD1ACP_SHIFT)) & QuadSPI_WORD2_MD1ACP_MASK)

#define QuadSPI_WORD2_EALO_MASK                  (0x3F000000U)
#define QuadSPI_WORD2_EALO_SHIFT                 (24U)
#define QuadSPI_WORD2_EALO_WIDTH                 (6U)
#define QuadSPI_WORD2_EALO(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_WORD2_EALO_SHIFT)) & QuadSPI_WORD2_EALO_MASK)
/*! @} */

/*! @name WORD3 - Flash Region Lock Control */
/*! @{ */

#define QuadSPI_WORD3_EAL_MASK                   (0x3000000U)
#define QuadSPI_WORD3_EAL_SHIFT                  (24U)
#define QuadSPI_WORD3_EAL_WIDTH                  (2U)
#define QuadSPI_WORD3_EAL(x)                     (((uint32_t)(((uint32_t)(x)) << QuadSPI_WORD3_EAL_SHIFT)) & QuadSPI_WORD3_EAL_MASK)

#define QuadSPI_WORD3_LOCK_MASK                  (0x60000000U)
#define QuadSPI_WORD3_LOCK_SHIFT                 (29U)
#define QuadSPI_WORD3_LOCK_WIDTH                 (2U)
#define QuadSPI_WORD3_LOCK(x)                    (((uint32_t)(((uint32_t)(x)) << QuadSPI_WORD3_LOCK_SHIFT)) & QuadSPI_WORD3_LOCK_MASK)

#define QuadSPI_WORD3_VLD_MASK                   (0x80000000U)
#define QuadSPI_WORD3_VLD_SHIFT                  (31U)
#define QuadSPI_WORD3_VLD_WIDTH                  (1U)
#define QuadSPI_WORD3_VLD(x)                     (((uint32_t)(((uint32_t)(x)) << QuadSPI_WORD3_VLD_SHIFT)) & QuadSPI_WORD3_VLD_MASK)
/*! @} */

/*! @name WORD4 - Flash Region Compare Address Status */
/*! @{ */

#define QuadSPI_WORD4_CMP_ADDR_MASK              (0xFFFFFFFFU)
#define QuadSPI_WORD4_CMP_ADDR_SHIFT             (0U)
#define QuadSPI_WORD4_CMP_ADDR_WIDTH             (32U)
#define QuadSPI_WORD4_CMP_ADDR(x)                (((uint32_t)(((uint32_t)(x)) << QuadSPI_WORD4_CMP_ADDR_SHIFT)) & QuadSPI_WORD4_CMP_ADDR_MASK)
/*! @} */

/*! @name WORD5 - Flash Region Compare Status Data */
/*! @{ */

