zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_QUADSPI.h
#define QuadSPI_IPSERROR_TG1MID_MASK             (0x2000U)
#define QuadSPI_IPSERROR_TG1MID_SHIFT            (13U)
#define QuadSPI_IPSERROR_TG1MID_WIDTH            (1U)
#define QuadSPI_IPSERROR_TG1MID(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_IPSERROR_TG1MID_SHIFT)) & QuadSPI_IPSERROR_TG1MID_MASK)

#define QuadSPI_IPSERROR_MDADPROG_MASK           (0x4000U)
#define QuadSPI_IPSERROR_MDADPROG_SHIFT          (14U)
#define QuadSPI_IPSERROR_MDADPROG_WIDTH          (1U)
#define QuadSPI_IPSERROR_MDADPROG(x)             (((uint32_t)(((uint32_t)(x)) << QuadSPI_IPSERROR_MDADPROG_SHIFT)) & QuadSPI_IPSERROR_MDADPROG_MASK)

#define QuadSPI_IPSERROR_FRADPROG_MASK           (0x8000U)
#define QuadSPI_IPSERROR_FRADPROG_SHIFT          (15U)
#define QuadSPI_IPSERROR_FRADPROG_WIDTH          (1U)
#define QuadSPI_IPSERROR_FRADPROG(x)             (((uint32_t)(((uint32_t)(x)) << QuadSPI_IPSERROR_FRADPROG_SHIFT)) & QuadSPI_IPSERROR_FRADPROG_MASK)

#define QuadSPI_IPSERROR_CLR_MASK                (0x20000000U)
#define QuadSPI_IPSERROR_CLR_SHIFT               (29U)
#define QuadSPI_IPSERROR_CLR_WIDTH               (1U)
#define QuadSPI_IPSERROR_CLR(x)                  (((uint32_t)(((uint32_t)(x)) << QuadSPI_IPSERROR_CLR_SHIFT)) & QuadSPI_IPSERROR_CLR_MASK)
/*! @} */

/*! @name ERRSTAT - Error Status */
/*! @{ */

#define QuadSPI_ERRSTAT_FRADMTCH_MASK            (0x1U)
#define QuadSPI_ERRSTAT_FRADMTCH_SHIFT           (0U)
#define QuadSPI_ERRSTAT_FRADMTCH_WIDTH           (1U)
#define QuadSPI_ERRSTAT_FRADMTCH(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_FRADMTCH_SHIFT)) & QuadSPI_ERRSTAT_FRADMTCH_MASK)

#define QuadSPI_ERRSTAT_FRAD0ACC_MASK            (0x2U)
#define QuadSPI_ERRSTAT_FRAD0ACC_SHIFT           (1U)
#define QuadSPI_ERRSTAT_FRAD0ACC_WIDTH           (1U)
#define QuadSPI_ERRSTAT_FRAD0ACC(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_FRAD0ACC_SHIFT)) & QuadSPI_ERRSTAT_FRAD0ACC_MASK)

#define QuadSPI_ERRSTAT_FRAD1ACC_MASK            (0x4U)
#define QuadSPI_ERRSTAT_FRAD1ACC_SHIFT           (2U)
#define QuadSPI_ERRSTAT_FRAD1ACC_WIDTH           (1U)
#define QuadSPI_ERRSTAT_FRAD1ACC(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_FRAD1ACC_SHIFT)) & QuadSPI_ERRSTAT_FRAD1ACC_MASK)

#define QuadSPI_ERRSTAT_FRAD2ACC_MASK            (0x8U)
#define QuadSPI_ERRSTAT_FRAD2ACC_SHIFT           (3U)
#define QuadSPI_ERRSTAT_FRAD2ACC_WIDTH           (1U)
#define QuadSPI_ERRSTAT_FRAD2ACC(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_FRAD2ACC_SHIFT)) & QuadSPI_ERRSTAT_FRAD2ACC_MASK)

#define QuadSPI_ERRSTAT_FRAD3ACC_MASK            (0x10U)
#define QuadSPI_ERRSTAT_FRAD3ACC_SHIFT           (4U)
#define QuadSPI_ERRSTAT_FRAD3ACC_WIDTH           (1U)
#define QuadSPI_ERRSTAT_FRAD3ACC(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_FRAD3ACC_SHIFT)) & QuadSPI_ERRSTAT_FRAD3ACC_MASK)

#define QuadSPI_ERRSTAT_FRAD4ACC_MASK            (0x20U)
#define QuadSPI_ERRSTAT_FRAD4ACC_SHIFT           (5U)
#define QuadSPI_ERRSTAT_FRAD4ACC_WIDTH           (1U)
#define QuadSPI_ERRSTAT_FRAD4ACC(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_FRAD4ACC_SHIFT)) & QuadSPI_ERRSTAT_FRAD4ACC_MASK)

#define QuadSPI_ERRSTAT_FRAD5ACC_MASK            (0x40U)
#define QuadSPI_ERRSTAT_FRAD5ACC_SHIFT           (6U)
#define QuadSPI_ERRSTAT_FRAD5ACC_WIDTH           (1U)
#define QuadSPI_ERRSTAT_FRAD5ACC(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_FRAD5ACC_SHIFT)) & QuadSPI_ERRSTAT_FRAD5ACC_MASK)

#define QuadSPI_ERRSTAT_FRAD6ACC_MASK            (0x80U)
#define QuadSPI_ERRSTAT_FRAD6ACC_SHIFT           (7U)
#define QuadSPI_ERRSTAT_FRAD6ACC_WIDTH           (1U)
#define QuadSPI_ERRSTAT_FRAD6ACC(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_FRAD6ACC_SHIFT)) & QuadSPI_ERRSTAT_FRAD6ACC_MASK)

#define QuadSPI_ERRSTAT_FRAD7ACC_MASK            (0x100U)
#define QuadSPI_ERRSTAT_FRAD7ACC_SHIFT           (8U)
#define QuadSPI_ERRSTAT_FRAD7ACC_WIDTH           (1U)
#define QuadSPI_ERRSTAT_FRAD7ACC(x)              (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_FRAD7ACC_SHIFT)) & QuadSPI_ERRSTAT_FRAD7ACC_MASK)

#define QuadSPI_ERRSTAT_IPS_ERR_MASK             (0x200U)
#define QuadSPI_ERRSTAT_IPS_ERR_SHIFT            (9U)
#define QuadSPI_ERRSTAT_IPS_ERR_WIDTH            (1U)
#define QuadSPI_ERRSTAT_IPS_ERR(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_IPS_ERR_SHIFT)) & QuadSPI_ERRSTAT_IPS_ERR_MASK)

#define QuadSPI_ERRSTAT_TG0SFAR_MASK             (0x400U)
#define QuadSPI_ERRSTAT_TG0SFAR_SHIFT            (10U)
#define QuadSPI_ERRSTAT_TG0SFAR_WIDTH            (1U)
#define QuadSPI_ERRSTAT_TG0SFAR(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_TG0SFAR_SHIFT)) & QuadSPI_ERRSTAT_TG0SFAR_MASK)

#define QuadSPI_ERRSTAT_TG1SFAR_MASK             (0x800U)
#define QuadSPI_ERRSTAT_TG1SFAR_SHIFT            (11U)
#define QuadSPI_ERRSTAT_TG1SFAR_WIDTH            (1U)
#define QuadSPI_ERRSTAT_TG1SFAR(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_TG1SFAR_SHIFT)) & QuadSPI_ERRSTAT_TG1SFAR_MASK)

#define QuadSPI_ERRSTAT_TG0IPCR_MASK             (0x1000U)
#define QuadSPI_ERRSTAT_TG0IPCR_SHIFT            (12U)
#define QuadSPI_ERRSTAT_TG0IPCR_WIDTH            (1U)
#define QuadSPI_ERRSTAT_TG0IPCR(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_TG0IPCR_SHIFT)) & QuadSPI_ERRSTAT_TG0IPCR_MASK)

#define QuadSPI_ERRSTAT_TG1IPCR_MASK             (0x2000U)
#define QuadSPI_ERRSTAT_TG1IPCR_SHIFT            (13U)
#define QuadSPI_ERRSTAT_TG1IPCR_WIDTH            (1U)
#define QuadSPI_ERRSTAT_TG1IPCR(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_TG1IPCR_SHIFT)) & QuadSPI_ERRSTAT_TG1IPCR_MASK)

#define QuadSPI_ERRSTAT_TO_ERR_MASK              (0x4000U)
#define QuadSPI_ERRSTAT_TO_ERR_SHIFT             (14U)
#define QuadSPI_ERRSTAT_TO_ERR_WIDTH             (1U)
#define QuadSPI_ERRSTAT_TO_ERR(x)                (((uint32_t)(((uint32_t)(x)) << QuadSPI_ERRSTAT_TO_ERR_SHIFT)) & QuadSPI_ERRSTAT_TO_ERR_MASK)
/*! @} */

/*! @name INT_EN - Interrupt Enable */
/*! @{ */

#define QuadSPI_INT_EN_FRADMTCH_MASK             (0x1U)
#define QuadSPI_INT_EN_FRADMTCH_SHIFT            (0U)
#define QuadSPI_INT_EN_FRADMTCH_WIDTH            (1U)
#define QuadSPI_INT_EN_FRADMTCH(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_FRADMTCH_SHIFT)) & QuadSPI_INT_EN_FRADMTCH_MASK)

#define QuadSPI_INT_EN_FRAD0ACC_MASK             (0x2U)
#define QuadSPI_INT_EN_FRAD0ACC_SHIFT            (1U)
#define QuadSPI_INT_EN_FRAD0ACC_WIDTH            (1U)
#define QuadSPI_INT_EN_FRAD0ACC(x)               (((uint32_t)(((uint32_t)(x)) << QuadSPI_INT_EN_FRAD0ACC_SHIFT)) & QuadSPI_INT_EN_FRAD0ACC_MASK)

